_orgs/2012-04-04-VPN_on_VPS.org
#+BEGIN_EXPORT html
---
layout: post
title: 有关VPN在VPS上的配置
tags: [gfw, share]
---
#+END_EXPORT


简单记载一下VPN在VPS的配置经过:
** 安装pptpd，具体根据发行版。

** 编辑/etc/pptpd.conf
去掉#的注释
option /etc/ppp/pptpd-options
localip 192.168.0.1
remoteip 192.168.0.234-238,192.168.0.245

** 编辑 /etc/ppp/pptpd-options 文件，设置 DNS
找到 ms-dns 去掉 # 号，并修改 DNS 地址

ms-dns 8.8.8.8
ms-dns 8.8.4.4

** 编辑 /etc/ppp/chap-secrets ，加入用户

用户名 pptpd 密码 *

** 编辑 /etc/sysctl.conf 文件，找到以下行，去掉 # 号注释符号

net.ipv4.ip_forward=1

然后在运行以下命令使配置生效

sysctl -p

** 向 nat 表中添加一条规则，如果没有iptables记得安装:

iptables -t nat -A POSTROUTING -s 192.168.0.0/24 -o eth0 -j
MASQUERADE

** 保存状态，免得重启无效
iptables-save > /etc/iptables-rules

然后修改 /etc/network/interfaces 文件，找到 venet0 的结点，添加 pre-up 那一行：
auto venet0
iface venet0 inet static
pre-up iptables-restore < /etc/iptables-rules

** 手动处理的情况

iptables-restore /etc/iptables-rules

** 参考
 * http://blog.jkey.lu/install-pptp-on-ubuntu/
 * http://wangyan.org/blog/debian-pptp-vpn.html




